results/spring-quarkus-perf-comparison/2026-03-24_23-22-29/wrk-warmup-spring3-jvm-aot-0.log
[0.001s][warning][os] NUMA support disabled: The process memory and cpu node configuration does not match
Running 2m test @ http://localhost:8080/fruits
  2 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    28.24ms   37.82ms 792.72ms   90.46%
    Req/Sec   3511.29   1100.94  5424.00     71.90
  424866 requests in 120.026s, 342.72MB read
Requests/sec: 3539.78
Transfer/sec:   2.86MB